**PANDAS**
* R dataframe yapısını python dunyasina tasimis ve dataframelerle etkili calismayyi ortaya koymustur

**Pandas Serisi Olusturmak**

In [1]:
import pandas as pd

In [2]:
seri = pd.Series([10,42,3,4])
seri

0    10
1    42
2     3
3     4
dtype: int64

In [3]:
seri.axes

[RangeIndex(start=0, stop=4, step=1)]

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.dtype

dtype('int64')

In [6]:
seri.size

4

In [7]:
seri.ndim

1

In [8]:
seri.values

array([10, 42,  3,  4], dtype=int64)

In [9]:
seri.head(2)

0    10
1    42
dtype: int64

In [10]:
seri2 = pd.Series([99,88,77,66,55], index=[1,3,5,7,9])   #bu sekilde indexlendirebliriz dilersek string degerler ile de indexleyebliriz

In [11]:
seri2[3]

88

In [12]:
#sozluk uzerinden liste olusturmak

In [13]:
sozluk = {"reg":10,"log":11,"cart":12}
seri3 = pd.Series(sozluk)
seri3

reg     10
log     11
cart    12
dtype: int64

In [14]:
#iki seriyi birlestirerek seri olusturma
pd.concat([seri3,seri3])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

**ELEMAN ISLEMLERI**

In [15]:
seri3.index

Index(['reg', 'log', 'cart'], dtype='object')

In [16]:
seri3.keys

<bound method Series.keys of reg     10
log     11
cart    12
dtype: int64>

In [17]:
list(seri3.items())

[('reg', 10), ('log', 11), ('cart', 12)]

In [18]:
"reg" in seri3

True

In [19]:
"reg" in seri

False

In [20]:
#fancy eleman

In [21]:
seri3[["reg","log"]]

reg    10
log    11
dtype: int64

**Pandas Ile DataFrame Olusturma**

In [22]:
l = [1,2,3,99,40]

In [23]:
pd.DataFrame(l, columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              3
3             99
4             40

In [24]:
import numpy as np
m= np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [25]:
pd.DataFrame(m, columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [26]:
df = pd.DataFrame(m, columns=["var1","var2","var3"])

In [27]:
df.head(2)

   var1  var2  var3
0     1     2     3
1     4     5     6

In [28]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['var1', 'var2', 'var3'], dtype='object')]

In [29]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [30]:
type(df.values)

numpy.ndarray

In [31]:
df.tail(1)

   var1  var2  var3
2     7     8     9

In [32]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [33]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}
sozluk

{'var1': array([7, 6, 9, 5, 7]),
 'var2': array([8, 7, 4, 1, 5]),
 'var3': array([2, 4, 0, 5, 1])}

In [34]:
df = pd.DataFrame(sozluk)

In [35]:
df

   var1  var2  var3
0     7     8     2
1     6     7     4
2     9     4     0
3     5     1     5
4     7     5     1

In [36]:
df.index= ["a","b","c","d","e"]

In [37]:
df["a":"d"]

   var1  var2  var3
a     7     8     2
b     6     7     4
c     9     4     0
d     5     1     5

In [38]:
#silme 
df.drop("a", axis=0)

   var1  var2  var3
b     6     7     4
c     9     4     0
d     5     1     5
e     7     5     1

In [39]:
df

   var1  var2  var3
a     7     8     2
b     6     7     4
c     9     4     0
d     5     1     5
e     7     5     1

In [40]:
#kalicilik icin 
df.drop("a",axis=0, inplace=True)

In [41]:
df

   var1  var2  var3
b     6     7     4
c     9     4     0
d     5     1     5
e     7     5     1

In [42]:
#fancy
l = ["c","e"]
df.drop(l, axis=0)

   var1  var2  var3
b     6     7     4
d     5     1     5

In [43]:
"var1" in df

True

In [44]:
l = ["var1","var4","var3"]

In [45]:
for i in l:
    print(i in df)

True
False
True

In [46]:
df["var4"] = df["var1"]/df["var2"]

In [47]:
df

   var1  var2  var3      var4
b     6     7     4  0.857143
c     9     4     0  2.250000
d     5     1     5  5.000000
e     7     5     1  1.400000

**Gözle Ve Degisken Secimi : loc & iloc**

In [158]:
m = np.random.randint(1,30 , size=(10,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df

   var1  var2  var3
0    17     3    11
1    15     3    22
2     8     3     7
3    21    16    12
4     2     9     7
5    12    12     6
6    16    12    11
7     6     9     1
8    23     3    10
9     2    27    27

In [49]:
#loc tanımlandigi sekli ile secimm yapmak icin kullanilir

In [159]:
df.loc[0:3]

   var1  var2  var3
0    17     3    11
1    15     3    22
2     8     3     7
3    21    16    12

In [51]:
#iloc alisik oldugumuz index mantigiyla secim yapar

In [160]:
df.iloc[0:3]

   var1  var2  var3
0    17     3    11
1    15     3    22
2     8     3     7

In [161]:
df.loc[0:3, "var3"]

0    11
1    22
2     7
3    12
Name: var3, dtype: int32

In [162]:
# df.iloc[:3, "var3"]  ata verir index ismine gore yapmak istedigimizde loc'u cagirmamiz gerekir

In [163]:
df.iloc[0:3]["var3"]

0    11
1    22
2     7
Name: var3, dtype: int32

In [164]:
df[df.var1>15]["var2"]

0     3
3    16
6    12
8     3
Name: var2, dtype: int32

In [165]:
df[(df.var1 > 15) & (df.var3 < 5)]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [166]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
0    17     3
3    21    16
6    16    12
8    23     3

In [167]:
df

   var1  var2  var3
0    17     3    11
1    15     3    22
2     8     3     7
3    21    16    12
4     2     9     7
5    12    12     6
6    16    12    11
7     6     9     1
8    23     3    10
9     2    27    27

In [168]:
df1 =  df+99
df1

   var1  var2  var3
0   116   102   110
1   114   102   121
2   107   102   106
3   120   115   111
4   101   108   106
5   111   111   105
6   115   111   110
7   105   108   100
8   122   102   109
9   101   126   126

In [60]:
pd.concat([df,df1])

   var1  var2  var3
0    18     4    16
1    24     4     2
2    12     1    18
3    15    19     8
4     2    17    18
5    21    26    21
6     7     8    28
7     4    21    15
8     7    10    16
9     5    10    10
0   117   103   115
1   123   103   101
2   111   100   117
3   114   118   107
4   101   116   117
5   120   125   120
6   106   107   127
7   103   120   114
8   106   109   115
9   104   109   109

In [61]:
pd.concat([df,df1], ignore_index=True)

    var1  var2  var3
0     18     4    16
1     24     4     2
2     12     1    18
3     15    19     8
4      2    17    18
5     21    26    21
6      7     8    28
7      4    21    15
8      7    10    16
9      5    10    10
10   117   103   115
11   123   103   101
12   111   100   117
13   114   118   107
14   101   116   117
15   120   125   120
16   106   107   127
17   103   120   114
18   106   109   115
19   104   109   109

In [62]:
df1.columns=["var1","var2","deg3"]

In [63]:
#   pd.concat([df,df1])   hatali cikti uretir farkli isimde sutun oldugundan

In [64]:
# cozum icin kesisimlerinin alinmasini isteriz
pd.concat([df,df1], join="inner" , ignore_index=True)

    var1  var2
0     18     4
1     24     4
2     12     1
3     15    19
4      2    17
5     21    26
6      7     8
7      4    21
8      7    10
9      5    10
10   117   103
11   123   103
12   111   100
13   114   118
14   101   116
15   120   125
16   106   107
17   103   120
18   106   109
19   104   109

**Toplulaştırma ve Gruplama (Aggregation & Grouping )**

Basit Toplulastirma Fonksiyonlari
* count()
* first()
* last()
* mean()
* median()
* min() / max()
* std()
* var()
* sum()

In [65]:
import seaborn as sns

In [66]:
df =sns.load_dataset("planets").head()
df

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [67]:
df.shape

(5, 6)

In [68]:
df.mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of             method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009>

In [69]:
df["distance"].mean()

76.85600000000002

In [70]:
df["distance"].count()

5

In [71]:
df["distance"].min()

19.84

In [72]:
df["distance"].sum()

384.2800000000001

In [73]:
df["distance"].var()   #varyansi

1650.83243

In [74]:
df.describe()   # tum veri seti bilgileri icin

       number  orbital_period       mass    distance         year
count     5.0        5.000000   5.000000    5.000000     5.000000
mean      1.0      549.864800   8.362000   76.856000  2008.200000
std       0.0      265.020376   7.054234   40.630437     1.923538
min       1.0      269.300000   2.210000   19.840000  2006.000000
25%       1.0      326.030000   2.600000   56.950000  2007.000000
50%       1.0      516.220000   7.100000   77.400000  2008.000000
75%       1.0      763.000000  10.500000  110.620000  2009.000000
max       1.0      874.774000  19.400000  119.470000  2011.000000

In [75]:
df.describe().T  # Tersini yani transpozunu al

,count,mean,std,min,25%,50%,75%,max
number,5.0,1.0000,0.000000,1.00,1.00,1.00,1.00,1.000
orbital_period,5.0,549.8648,265.020376,269.30,326.03,516.22,763.00,874.774
mass,5.0,8.3620,7.054234,2.21,2.60,7.10,10.50,19.400
distance,5.0,76.8560,40.630437,19.84,56.95,77.40,110.62,119.470
year,5.0,2008.2000,1.923538,2006.00,2007.00,2008.00,2009.00,2011.000

In [76]:
df.dropna().describe().T     #eksik degerleri cikardik dropna() ile

,count,mean,std,min,25%,50%,75%,max
number,5.0,1.0000,0.000000,1.00,1.00,1.00,1.00,1.000
orbital_period,5.0,549.8648,265.020376,269.30,326.03,516.22,763.00,874.774
mass,5.0,8.3620,7.054234,2.21,2.60,7.10,10.50,19.400
distance,5.0,76.8560,40.630437,19.84,56.95,77.40,110.62,119.470
year,5.0,2008.2000,1.923538,2006.00,2007.00,2008.00,2009.00,2011.000

**GRUPLAMA ISLEMI**

In [79]:
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                  'veri':[10,11,52,23,43,55]}, columns=['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [82]:
df.groupby("gruplar").mean()   #groupby("...") ile verdigin kategoriyi grupluyor ve senden bir islem yapmasini istemeni bekliyor orn: mean()/sum()...

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [83]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [86]:
df =sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [87]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [88]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [89]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

**Ileri Toplulastirma Islemleri (Aggregate,filter,transform,apply)**

In [91]:
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                  'degisken1':[10,11,52,23,43,55], 'degisken2':[110,121,522,213,143,515]}, columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        110
1       B         11        121
2       C         52        522
3       A         23        213
4       B         43        143
5       C         55        515

In [93]:
#aggregate  - toplam,toplanmis, butun

In [102]:
df.groupby("gruplar").aggregate(['min',np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.5  23       110  161.5  213
B              11   27.0  43       121  132.0  143
C              52   53.5  55       515  518.5  522

In [103]:
df.groupby("gruplar").aggregate({'degisken1':'min','degisken2':'max'})

         degisken1  degisken2
gruplar
A               10        213
B               11        143
C               52        522

In [104]:
#filter

In [112]:
def filter_func(x):
    return x["degisken1"].std()>9

In [113]:
df.groupby("gruplar").std()

         degisken1  degisken2
gruplar
A         9.192388  72.831998
B        22.627417  15.556349
C         2.121320   4.949747

In [108]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
1       B         11        121
4       B         43        143

In [114]:
#transform

In [115]:
df["degisken1"]*9

0     90
1     99
2    468
3    207
4    387
5    495
Name: degisken1, dtype: int64

In [116]:
df_a = df.iloc[:,1:3]

In [119]:
df_a.transform(lambda x: (x-x.mean())/x.std())    #Python'un Transform işlevi, parametresinde belirtilen işlevi 
                                                #uyguladıktan sonra dönüştürülmüş değerlerle kendi ürettiği bir veri çerçevesi döndürür.

   degisken1  degisken2
0  -1.101533  -0.822677
1  -1.052210  -0.766353
2   0.970006   1.286926
3  -0.460342  -0.295276
4   0.526105  -0.653704
5   1.117974   1.251084

In [124]:
#apply  tipki tarnsform ve filter gibi degiskenler uzerinde gezinme yetenegi olan , tolulastirma amaciyla
# kullanilan bir fonksiyondur
df = pd.DataFrame({'degisken1':[10,11,52,23,43,55],
                   'degisken2':[110,121,522,213,143,515]},
                  columns=['degisken1','degisken2'])
df

   degisken1  degisken2
0         10        110
1         11        121
2         52        522
3         23        213
4         43        143
5         55        515

In [125]:
df.apply(np.sum)

degisken1     194
degisken2    1624
dtype: int64

**PIVOT TABLOLAR**

In [126]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [134]:
titanic.groupby(["sex","survived"])[["age"]].mean()   # age'in oldugu kisima iki koseli parantez koyarsak dataframe  olur

                       age
sex    survived
female 0         25.046875
       1         28.847716
male   0         31.618056
       1         27.276022

In [135]:
titanic.groupby("sex")["survived"].mean()   #kadinlarin hayatta kalma orani cok daha fazla

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [139]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [138]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

**#pivot ile table**

In [141]:
titanic.pivot_table("survived", index="sex",columns="class")   #index olarak verileni satir olarak kullandi

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [142]:
# age i kategorik degiskene donusturelim
age = pd.cut(titanic["age"], [0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [144]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

**DIS KAYNAKLI VERI OKUMAK**

In [151]:
pd.read_csv('/Users/technopc/Desktop/veri bilimii/reading_data-master/ornekcsv.csv', sep=';')  # sep burada ; ile 
                                                                                               # ayrilmis olarak yazilmis veriyi duzeltmeye yaradi

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [154]:
pd.read_csv("/Users/technopc/Desktop/veri bilimii/reading_data-master/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [156]:
df = pd.read_excel("/Users/technopc/Desktop/veri bilimii/reading_data-master/ornekx.xlsx")